Repository: oxygenxml/blog
Catalog: translations/xliff/2nd translation/translated/oxygen_xml_blog_ro.ditamap.tmx
Source language: en
Languages: ro

source: OpenAI - Connect to your own OpenAI server using your own key. Or connect to OpenAI-compatible servers like Ollama .
ro: OpenAI - Conectați-vă la propriul server OpenAI folosind cheia proprie. Sau conectați-vă la servere compatibile OpenAI precum Ollama .

source: Microsoft Azure Open AI - Connect to an Open AI instance hosted as a virtual machine on Microsoft Azure.
ro: Microsoft Azure Open AI - Conectați-vă la o instanță Open AI găzduită ca mașină virtuală pe Microsoft Azure.

source: Anthropic Claude - Connect to Anthropic Claude using your own key.
ro: Anthropic Claude - Conectați-vă la Anthropic Claude folosind cheia proprie.

source: From the licensing point of view, the AI Positron Enterprise add-on works free of charge with any Oxygen XML Editor installation using an Enterprise license type for Oxygen XML Editor. For other cases, a special license key needs to be purchased for the add-on to enable this direct access. You can use the Register button in the AI Positron side view to configure the special license key.
ro: Din punct de vedere al licențierii, suplimentul AI Positron Enterprise funcționează gratuit cu orice instalare Oxygen XML Editor care utilizează un tip de licență Enterprise pentru Oxygen XML Editor. În celelalte cazuri, trebuie achiziționată o cheie de licență specială pentru ca suplimentul să permită acest acces direct. Puteți folosi butonul Register din panoul lateral AI Positron pentru a configura cheia de licență specială.

source: Oxygen XML Web Author also allows installing an AI Positron plugin with similar functionality as the one in the Oxygen Desktop application.
ro: Oxygen XML Web Author permite, de asemenea, instalarea unui plugin AI Positron cu funcționalitate similară cu cea din aplicația Oxygen Desktop.

source: Integration and Features Overview
ro: Prezentare generală a integrării și funcționalităților

source: After installing the add-on, the following features are available in the Oxygen desktop:
ro: După instalarea suplimentului, următoarele funcționalități sunt disponibile în Oxygen desktop:

source: AI Positron side view. This side view contains the following functionality:
ro: Panoul lateral AI Positron . Acest panou conține următoarele funcționalități:

source: Invoke various actions to generate and re-write content using AI.
ro: Apelați diverse acțiuni pentru a genera și rescrie conținut folosind AI.

source: Chat with the AI.
ro: Chat cu AI-ul.

source: A History list of previous interactions.
ro: O listă History cu interacțiunile anterioare.

source: A Favorites drop-down list and a way to mark inputs as favorites.
ro: O listă derulantă Favorites și o modalitate de a marca intrările ca favorite.

source: The Insert Editor Variables drop-down list allows inserting various editor variables which are expanded when the chat message is sent to the AI engine.
ro: Lista derulantă Insert Editor Variables permite inserarea diferitelor variabile de editor care sunt expandate când mesajul de chat este trimis către motorul AI.

source: An Attach button to attach images or XML text resources to the chat message.
ro: Un buton Attach pentru a atașa imagini sau resurse text XML la mesajul de chat.

source: AI main menu entry with support to invoke actions or to go to the add-on's preferences page.
ro: Intrare principală de meniu AI cu suport pentru a apela acțiuni sau pentru a accesa pagina de preferințe a suplimentului.

source: AI Positron contextual menu for all XML documents opened in the Author visual editing mode.
ro: Meniu contextual AI Positron pentru toate documentele XML deschise în modul vizual Author .

source: AI Positron quick assist actions available on the left vertical stripe for all XML documents opened in the Author visual editing mode.
ro: Acțiuni rapide AI Positron disponibile pe bara verticală din stânga pentru toate documentele XML deschise în modul vizual Author .

source: AI Positron Refactoring actions added to the Project and DITA Maps Manager views as a way to run actions on multiple files.
ro: Acțiuni AI Positron Refactoring adăugate în vizualizările Project și DITA Maps Manager ca modalitate de a rula acțiuni pe mai multe fișiere.

source: When validation problems are displayed in the Results pane, you can right-click on a problem and use the AI Positron Fix action to ask the AI Positron platform for help with fixing the problem. It will propose content in the chat pane (within the AI Positron view) that can be used to solve the problem.
ro: Când problemele de validare sunt afișate în panoul Results , puteți face clic dreapta pe o problemă și folosi acțiunea AI Positron Fix pentru a solicita platformei AI Positron ajutor la remedierea problemei. Aceasta va propune conținut în panoul de chat (din vizualizarea AI Positron ) care poate fi folosit pentru a rezolva problema.

source: The add-on contributes two XPath extension functions ( ai:transform-content and ai:verify-content ) that can be used to rephrase content or to perform validation checks on existing content.
ro: Suplimentul adaugă două funcții de extensie XPath ( ai:transform-content și ai:verify-content ) care pot fi folosite pentru a reformula conținutul sau pentru a efectua verificări de validare pe conținutul existent.

source: Predefined and Custom Actions
ro: Acțiuni predefinite și personalizate

source: Once you log in to the server, a set of predefined actions are available, grouped in categories: Accessibility , Content Generation , Development , Rewrite , Overview , Marketing , and Translation . The AI Positron Samples Playground samples project contains useful samples to test the functionality of these actions.
ro: Odată ce v-ați autentificat pe server, este disponibil un set de acțiuni predefinite , grupate pe categorii: Accessibility , Content Generation , Development , Rewrite , Overview , Marketing și Translation . Proiectul de exemple AI Positron Samples Playground conține exemple utile pentru a testa funcționalitatea acestor acțiuni.

source: Custom actions can also be created and used. The same AI Positron Samples Playground contains some sample custom actions. Some usage examples can be found in the samples playground .
ro: Acțiuni personalizate pot fi de asemenea create și utilizate. Același AI Positron Samples Playground conține câteva exemple de acțiuni personalizate. Câteva exemple de utilizare pot fi găsite în samples playground .

source: Visual Image Recognition (Vision)
ro: Recunoaștere vizuală a imaginilor (Vision)

source: The pre-defined Generate Documentation Draft and Update Content Based on Images actions allow using the AI to create or update content depending on existing images from your user's manual. You can also attach images in the Chat panel.
ro: Acțiunile predefinite Generate Documentation Draft și Update Content Based on Images permit utilizarea AI pentru a crea sau actualiza conținut în funcție de imaginile existente din manualul utilizatorului. De asemenea, puteți atașa imagini în panoul Chat .

source: Batch Processing
ro: Procesare în lot

source: The AI Positron Refactoring actions added to the Project and DITA Maps Manager views are a way to run actions on multiple files. For example, you could use the predefined Translate to action to translate multiple DITA topics into a certain language or apply the Correct Grammar or Improve Readability actions on multiple resources.
ro: Acțiunile AI Positron Refactoring adăugate în vizualizările Project și DITA Maps Manager reprezintă o modalitate de a rula acțiuni pe mai multe fișiere. De exemplu, puteți folosi acțiunea predefinită Translate to pentru a traduce mai multe topicuri DITA într-o anumită limbă sau puteți aplica acțiunile Correct Grammar sau Improve Readability pe mai multe resurse.

source: In addition, XML Refactoring actions based on XSLT or XQuery can use the XPath extension functions added by the add-on to perform batch changes in XML documents. Some examples can be found in the samples playground .
ro: În plus, acțiunile XML Refactoring bazate pe XSLT sau XQuery pot folosi funcțiile de extensie XPath adăugate de supliment pentru a efectua modificări în lot în documentele XML. Câteva exemple pot fi găsite în samples playground .

source: Useful Links
ro: Linkuri utile

source: Blog Post About AI Positron Add-on By Tom Johnson
ro: Articol pe blog despre AI Positron Add-on de Tom Johnson

source: Webinar: AI as a Tool for Technical Content Creation
ro: Webinar: AI ca instrument pentru crearea de conținut tehnic

source: Webinar: Leveraging the Power of AI and Schematron for Content Verification and Correction
ro: Webinar: Valorificarea puterii AI și Schematron pentru verificarea și corectarea conținutului

source: Meetup Recording: Oxygen AI Positron Assistant - Integrating AI Across Oxygen Tools
ro: Înregistrare meetup: Oxygen AI Positron Assistant - Integrarea AI în toate instrumentele Oxygen

source: AI XPath Extension Functions in Oxygen XML Editor
ro: Funcții de extensie XPath AI în Oxygen XML Editor

source: The integration of AI-driven XPath extension functions in Oxygen XML Editor represents a major step forward in the XML content lifecycle by introducing intelligent automation. These features improve Schematron, XSLT, and XQuery workflows by enabling natural language-driven rephrasing, validation, and custom AI-powered actions directly within your schemas and stylesheets. This post provides an overview of the key functions, practical examples, and configuration options to help you use these AI capabilities effectively, safely, and at scale.
ro: Integrarea funcțiilor de extensie XPath bazate pe AI în Oxygen XML Editor reprezintă un pas major înainte în ciclul de viață al conținutului XML, prin introducerea automatizării inteligente. Aceste funcționalități îmbunătățesc fluxurile de lucru Schematron, XSLT și XQuery, permițând reformularea, validarea și acțiunile personalizate alimentate de AI, direct în schemele și foile de stil ale dumneavoastră, folosind limbaj natural. Acest articol oferă o prezentare generală a funcțiilor cheie, exemple practice și opțiuni de configurare pentru a vă ajuta să utilizați aceste capabilități AI eficient, sigur și la scară largă.

source: Meet the AI XPath Extension Functions
ro: Faceți cunoștință cu funcțiile de extensie XPath AI

source: The Oxygen AI Positron add-on introduces three primary functions (namespace http://www.oxygenxml.com/ai/function ) that can be used directly in Schematron, XSLT, XQuery, XProc, and XPath expressions:
ro: Suplimentul Oxygen AI Positron introduce trei funcții principale (namespace http://www.oxygenxml.com/ai/function ) care pot fi utilizate direct în expresii Schematron, XSLT, XQuery, XProc și XPath:

source: Purpose: Transforms or rephrases content using AI, guided by a system prompt and user-provided input.
ro: Scop: Transformă sau reformulează conținutul folosind AI, ghidat de un prompt de sistem și de inputul furnizat de utilizator.

source: Parameters:
ro: Parametri:

source: system: Context or rule (e.g., “Follow company style guidelines”).
ro: system: Context sau regulă (ex.: „Respectă ghidul de stil al companiei”).

source: user: The input text to be transformed.
ro: user: Textul de intrare care trebuie transformat.

source: assistant: (Optional, repeatable) Previous AI responses for context in multi-stage operations.
ro: assistant: (Opțional, repetabil) Răspunsuri AI anterioare pentru context în operațiuni multi-etapă.

source: Returns: AI-generated, transformed string.
ro: Returnează: Șir generat de AI, transformat.

source: Sample Use in Schematron:
ro: Exemplu de utilizare în Schematron:

source: <sqf:replace match="text()" select="ai:transform-content('Reformulate phrase to be less than 50 words', .)"/>
ro: <sqf:replace match="text()" select="ai:transform-content('Reformulează fraza să aibă mai puțin de 50 de cuvinte', .)"/>

source: Purpose: Validates content using natural language prompts, returning a Boolean result.
ro: Scop: Validează conținutul folosind prompturi în limbaj natural, returnând un rezultat Boolean.

source: Parameters: Same as above.
ro: Parametri: La fel ca mai sus.

source: Returns: Boolean (true/false), ideal for driving Schematron assertions.
ro: Returnează: Boolean (adevărat/fals), ideal pentru a conduce aserțiuni Schematron.

source: <sch:report test="ai:verify-content('Does the following content have passive voice?', .)" sqf:fix="rephrase"> The phrase uses passive voice. </sch:report>
ro: <sch:report test="ai:verify-content('Conține următorul conținut diateza pasivă?', .)" sqf:fix="rephrase"> Fraza folosește diateza pasivă. </sch:report>

source: Purpose: Executes a pre-configured AI action with additional context or prompts on a given content block.
ro: Scop: Execută o acțiune AI preconfigurată cu context suplimentar sau prompturi pe un bloc de conținut dat.

source: actionId: ID of the registered AI action.
ro: actionId: ID-ul acțiunii AI înregistrate.

source: extraPrompt: Additional context for the action.
ro: extraPrompt: Context suplimentar pentru acțiune.

source: content: XML node or string to process.
ro: content: Nod XML sau șir de procesat.

source: Returns: The transformed (or analyzed) string.
ro: Returnează: Șirul transformat (sau analizat).

source: <sqf:replace match="text()" select="ai:invoke-action('Reformulate phrase to be less than 50 words', .)"/>
ro: <sqf:replace match="text()" select="ai:invoke-action('Reformulează fraza să aibă mai puțin de 50 de cuvinte', .)"/>

source: Real-World Example: Optimizing Short Descriptions
ro: Exemplu din practică: Optimizarea descrierilor scurte

source: Validation & Refactoring in One Step:
ro: Validare și refactorizare într-un singur pas:

source: This example demonstrates a rule that validates if a short description exceeds 50 words and provides an automated fix to rephrase it to meet the word limit. The rule uses Schematron and Smart Fix (SQF) to ensure concise and effective short descriptions.
ro: Acest exemplu demonstrează o regulă care validează dacă o descriere scurtă depășește 50 de cuvinte și oferă o corecție automată pentru a o reformula astfel încât să respecte limita de cuvinte. Regula folosește Schematron și Smart Fix (SQF) pentru a asigura descrieri scurte concise și eficiente.

source: <sch:rule context="shortdesc"> <sch:report test="count(tokenize(.,'\s+')) > 50" sqf:fix="rephrase"> The phrase must contain less than 50 words. </sch:report> <sqf:fix id="rephrase"> <sqf:description> <sqf:title>Rephrase phrase to be less than 50 words</sqf:title> </sqf:description> <sqf:replace match="text()" select="ai:transform-content('Reformulate phrase to be less than 50 words', .)"/> </sqf:fix> </sch:rule>
ro: <sch:rule context="shortdesc"> <sch:report test="count(tokenize(.,'\s+')) > 50" sqf:fix="rephrase"> Fraza trebuie să conțină mai puțin de 50 de cuvinte. </sch:report> <sqf:fix id="rephrase"> <sqf:description> <sqf:title>Reformulează fraza să aibă mai puțin de 50 de cuvinte</sqf:title> </sqf:description> <sqf:replace match="text()" select="ai:transform-content('Reformulează fraza să aibă mai puțin de 50 de cuvinte', .)"/> </sqf:fix> </sch:rule>

source: Active Voice Checker:
ro: Verificator de voce activă:

source: This example illustrates a rule that checks if a short description contains passive voice and provides an automated fix to rephrase it into active voice. The rule leverages AI-based content verification and transformation to enhance the clarity and impact of the text.
ro: Acest exemplu ilustrează o regulă care verifică dacă o descriere scurtă conține diateza pasivă și oferă o corecție automată pentru a o reformula în diateza activă. Regula utilizează verificarea și transformarea conținutului bazate pe AI pentru a spori claritatea și impactul textului.

source: <sch:rule context="shortdesc"> <sch:report test="ai:verify-content('Does the following content have passive voice?', .)" sqf:fix="rephrase">The phrase uses passive voice.</sch:report> <sqf:fix id="rephrase"> <sqf:description> <sqf:title>Rephrase text to be active voice</sqf:title> </sqf:description> <sqf:replace match="text()" select="ai:transform-content('Rephrase text to be active voice', .)"/> </sqf:fix> </sch:rule>
ro: <sch:rule context="shortdesc"> <sch:report test="ai:verify-content('Conține următorul conținut diateza pasivă?', .)" sqf:fix="rephrase">Fraza folosește diateza pasivă.</sch:report> <sqf:fix id="rephrase"> <sqf:description> <sqf:title>Reformulează textul în diateza activă</sqf:title> </sqf:description> <sqf:replace match="text()" select="ai:transform-content('Reformulează textul în diateza activă', .)"/> </sqf:fix> </sch:rule>

source: Refactor Content Using XSL and AI
ro: Refactorizarea conținutului folosind XSL și AI

source: The combination of AI and XSLT allows for dynamic and intelligent content transformation. By utilizing AI-driven XPath extension functions, you can automate tasks such as generating alternate text for images, ensuring accessibility and compliance with minimal manual intervention.
ro: Combinarea AI cu XSLT permite transformarea dinamică și inteligentă a conținutului. Utilizând funcțiile de extensie XPath bazate pe AI, puteți automatiza sarcini precum generarea textului alternativ pentru imagini, asigurând accesibilitatea și conformitatea cu un efort manual minim.

source: Example: Generate Alternate Text for Images
ro: Exemplu: Generarea textului alternativ pentru imagini

source: The following XSLT template generates alternate text for images with a `keyref` attribute but without an `alt` attribute. The template employs the `ai:transform-content` function to create a concise alternate text description for the image. The generated alternate text is then added to the `alt` element within the copied image node. This method ensures that all images that lack alternate text are enhanced with meaningful descriptions, improving both accessibility and usability.
ro: Următorul șablon XSLT generează text alternativ pentru imaginile care au atributul `keyref`, dar nu au atributul `alt`. Șablonul utilizează funcția `ai:transform-content` pentru a crea o descriere alternativă concisă pentru imagine. Textul alternativ generat este apoi adăugat în elementul `alt` din cadrul nodului imagine copiat. Această metodă asigură că toate imaginile fără text alternativ sunt completate cu descrieri relevante, îmbunătățind atât accesibilitatea, cât și utilizabilitatea.

source: <xsl:template match="image[@keyref][not(alt)]"> <xsl:copy> <xsl:apply-templates select="@*"/> <alt> <xsl:value-of select=" ai:transform-content( 'Create a short alternate text description for this image:', concat('{attach(', resolve-uri(@href, base-uri()), ')}'))"/> </alt> <xsl:apply-templates select="node()"/> </xsl:copy> </xsl:template>
ro: <xsl:template match="image[@keyref][not(alt)]"> <xsl:copy> <xsl:apply-templates select="@*"/> <alt> <xsl:value-of select=" ai:transform-content( 'Creează o scurtă descriere alternativă pentru această imagine:', concat('{attach(', resolve-uri(@href, base-uri()), ')}'))"/> </alt> <xsl:apply-templates select="node()"/> </xsl:copy> </xsl:template>

source: This example demonstrates how AI can dynamically generate meaningful alternate text for images, ensuring your content is accessible and enriched with metadata.
ro: Acest exemplu demonstrează cum AI poate genera dinamic texte alternative relevante pentru imagini, asigurând că materialul dumneavoastră este accesibil și îmbogățit cu metadate.

source: Example: Language Translation and Validation
ro: Exemplu: Traducere și validare lingvistică

source: The following XSLT template showcases how AI-driven XPath functions can be used for multi-language translation and validation. In this example, content is translated into French in three variants, then translated back into English. The English translations are compared with the original content to determine the most accurate French translation:
ro: Următorul șablon XSLT arată cum funcțiile XPath bazate pe AI pot fi folosite pentru traducere și validare multilingvă. În acest exemplu, conținutul este tradus în franceză în trei variante, apoi tradus înapoi în engleză. Traducerile în engleză sunt comparate cu conținutul original pentru a determina cea mai precisă traducere în franceză:

source: <xsl:template match="text()"> <xsl:variable name="agentFrench" select="ai:transform-content('Translate to French in 3 variants ', .)"/> <xsl:variable name="agentEnglish" select="ai:transform-content('Translate content from French to English ', $agentFrench)"/> <xsl:value-of select="ai:transform-content( 'Compare the English translation with original content and use the correct French translation. ', 'Translate to french in 3 variants ', $agentFrench, 'Translate from french to english ', $agentEnglish,.)"/> </xsl:template>
ro: <xsl:template match="text()"> <xsl:variable name="agentFrench" select="ai:transform-content('Tradu în franceză în 3 variante ', .)"/> <xsl:variable name="agentEnglish" select="ai:transform-content('Tradu conținutul din franceză în engleză ', $agentFrench)"/> <xsl:value-of select="ai:transform-content( 'Compară traducerea în engleză cu conținutul original și folosește traducerea corectă în franceză. ', 'Tradu în franceză în 3 variante ', $agentFrench, 'Tradu din franceză în engleză ', $agentEnglish,.)"/> </xsl:template>

source: This method ensures that the final French translation is both accurate and contextually appropriate, leveraging AI's capabilities to process and validate multilingual content effectively.
ro: Această metodă asigură că traducerea finală în franceză este atât precisă, cât și adecvată contextului, valorificând capabilitățile AI pentru a procesa și valida eficient conținut multilingv.

source: Configuration Options: Balancing Power and Performance
ro: Opțiuni de configurare: echilibrarea puterii și performanței

source: Oxygen provides several options to customize AI function behavior according to your project’s requirements:
ro: Oxygen oferă mai multe opțiuni pentru a personaliza comportamentul funcțiilor AI în funcție de cerințele proiectului dumneavoastră:

source: Enable XPath Functions
ro: Activează funcțiile XPath

source: Purpose: Activates AI-driven XPath functions for Schematron/XSLT validation and transformation.
ro: Scop: Activează funcțiile XPath bazate pe AI pentru validare și transformare Schematron/XSLT.

source: Default: Enabled.
ro: Implicit: Activat.

source: Cache Responses and Reuse Them for Identical Prompts
ro: Cachează răspunsurile și reutilizează-le pentru prompturi identice

source: Purpose: Minimizes redundant API calls and accelerates validation/transformation by caching AI responses for identical inputs.
ro: Scop: Minimizează apelurile API redundante și accelerează validarea/transformarea prin cache-ul răspunsurilor AI pentru inputuri identice.

source: Management: A "Clear cache" button allows you to instantly delete all stored responses.
ro: Administrare: Un buton „Șterge cache-ul” vă permite să ștergeți instantaneu toate răspunsurile stocate.

source: Cache Size
ro: Dimensiune cache

source: Purpose: Sets an upper limit on the number of responses that can be cached, preventing excessive memory/resource usage.
ro: Scop: Stabilește o limită superioară pentru numărul de răspunsuri care pot fi stocate în cache, prevenind utilizarea excesivă a memoriei/resurselor.

source: Notify Me When the Number of Requests Exceeds…
ro: Notifică-mă când numărul de cereri depășește…

source: Purpose: Provides a safeguard for large-scale operations.
ro: Scop: Oferă o măsură de siguranță pentru operațiuni la scară mare.
